{
  "LANGUAGE_CODE": "ca",
  "HOME": "INICI",
  "EDUCATION": "FORMACIÓ",
  "WORK EXPERIENCE": "EXPERIÈNCIA LABORAL",
  "PROJECTS": "PROJECTES",
  "ABOUT ME": "SOBRE MI",
  "CONTACT": "CONTACTE",
  "Software Developer": "Desenvolupador de software",
  "see more": "vore més",
  "language": "idioma",
  "ACADEMIC TRAINING": "FORMACIÓ ACADÈMICA",
  "COURSES": "CURSOS",
  "BACHELOR OF SCIENCES": "BATXILLERAT DE CIÈNCIES",
  "BACHELOR": "BATXILLERAT",
  "SCIENCES": "CIENTÍFIC",
  "ASSOCIATE DEGREE IN NETWORK SYSTEM ADMINISTRATION": "CICLE FORMATIU DE GRAU SUPERIOR DE ADMINISTRACIÓ DE SISTEMES INFORMÀTICS EN RED",
  "ASSOCIATE DEGREE": "CICLE FORMATIU DE GRAU SUPERIOR",
  "NETWORK SYSTEM ADMINISTRATION": "ADMINISTRACIÓ DE SISTEMES INFORMÀTICS EN RED",
  "NSA": "CFGS ASIR",
  "ASSOCIATE DEGREE IN WEB DEVELOPMENT": "CICLE FORMATIU DE GRAU SUPERIOR EN DESENVOLUPAMENT DE APLICACIONS WEB",
  "WEB DEVELOPMENT": "DESENVOLUPAMENT D'APLICACIONS WEB",
  "WD": "CFGS DAW",
  "Torrent (Valencia, Spain)": "Torrent (València, Espanya)",
  "Valencia (Spain)": "València (Espanya)",
  "Good practices on Angular": "Bones pràctiques en Angular",
  "Clean Code": "Clean Code",
  "Refactoring and Clean Code techniques": "Tècniques de Refactoring i Clean Code",
  "Node.js and Express": "Node.js y Express",
  "Kubernetes by a DevOps Guru": "Kubernetes per un Gurú de DevOps",
  "Project management Software with Git and GitHub": "Gestió de projectes Software amb Git i GitHub",
  "Download the certificate": "Descarregar el certificat",
  "August 2017": "Agost 2017",
  "January 2019": "Gener 2019",
  "Task performed": "Tasques realitzades",
  "Systems Administrator": "Administrador de sistemes",
  "ODEC_SOFTARE_DEVELOP_DESCRIPTION": "Vaig començar en el desenvolupament de software en un projecte de mobilitat, on es creava una aplicació Android, usant Android Studio, i fent servir JAVA com a llenguatge de l'aplicació. Després vaig entrar en un altre projecte que consistia en un desenvolupament web des de 0. En aquest projecte vam utilitzar AngularJS (1.6) per front-end i JAVA per a back-end, en el qual varem fer servir diversos patrons, entre ells injecció de dependències i programació per capes. A més incorporava Spring e Hibernate per a la persistència de dades i com a ORM. Pel que fa a la base de dades es feia servir MYSQL, i vaig estar fent tasques de full-stack i DevOps, creant les noves funcionalitats, manteniments i desplegaments. Després vaig entrar en altres projectes de menor durada on vaig fer servir SQL, JSF, JSP...",
  "Administration of physical servers in a private CPD": "Administració de servidors físics en un CPD privat",
  "Administration of development teams": "Administració dels equips de desenvolupament",
  "Data and network control": "Control de dades i xarxes",
  "Virtualization of physical machines": "Virtualització de màquines físiques",
  "Internal Software Audits": "Auditories internes de software",
  "Security controls and alerts": "Controls i alertes de seguretat",
  "Purchases of hardware and complementary material": "Gestions de compra de hardware i material complementari",
  "Management and creation of company accounts": "Gestió i creació de comptes d'empresa",
  "Preparation of environments for development teams": "Preparació d'entorns per a equips de desenvolupament",
  "Welcome to my website!": "Benvingut/da a la meua pàgina web!",
  "I'm Iván Córdoba Donet": "Sóc Iván Córdoba Donet",
  "and I work as a software developer": "i treballe com a desenvolupador de software",
  "GUD_SOFTARE_DEVELOP_DESCRIPTION": "Durant la meua feina a Green Urban Data vaig aprendre moltes coses com ara arquitectura hexagonal (DDD), testing unitari i e2e amb metodologies com TDD, bones pràctiques i clean code, entre moltes altres coses. Em centrava en tasques completes per al desenvolupament de noves funcionalitats (tant front, back, servidors o base de dades). Les principals tecnologies usades eren docker i docker-compose on conteníem la web, Angular al front amb Cypress per al test e2e, Laravel en el back i PostgreSQL per a la base de dades. Per tot això feiem servir els servidors de AWS. Una altra cosa a destacar era la implementació de CI/CD amb l'ús de CircleCI, que junt a git ens permetia aquesta posta de valor contínua i segura.",
  "Contact me!": "Contacta'm!",
  "Do you have a project in mind?": "Tens un projecte en ment?",
  "Do you want a collaboration?": "Vols una col·laboració?",
  "Do you need some help?": "Necessites ajuda?",
  "You can send me an email to": "Pots enviar-me un correu electrònic a",
  "or fill out the form": "o completar el formulari",
  "I need to know your name": "Necessite saber el teu nom",
  "Please enter a valid email address": "Per favor, introdueix una adreça de correu electrònic vàlida",
  "Maybe you want me to contact you": "Potser vols que contacte amb tu",
  "The sum is not correct, maybe you are a robot!": "La suma no és correcta, ¡potser sigues un robot!",
  "It is required to avoid robots": "Es requereix per evitar robots",
  "What do you want to tell me?": "Què vols dir-me?",
  "Send me your message": "Envia'm el teu missatge",
  "Name": "Nom",
  "E-mail": "Email",
  "Leave a message": "Deixa un missatge",
  "ABOUT_ME_DESCRIPTION": "Em considere una persona treballadora i eficaç. Vaig estudiar administració de sistemes i desenvolupament web, pel que puc fer qualsevol tipus de tasques, m'encanta la programació i m'agrada aprendre sempre les últimes tecnologies. Crec que un bon treball no és només que funcione, sinó que des de dins estiga ben estructurat, siga eficient i per descomptat escalable i sense errors. Els llenguatges que més use són Javascript amb Angular, PHP amb Laravel i JAVA junt a Spring i Hibernate, i pel que fa a les base de dades he utilitzat MySql, PostgreSQL i SQLite, i tinc experiència en AWS. Tot això junt a bones pràctiques de desenvolupament, coneixements d'arquitectura hexagonal i testing fa que es puga desenvolupar de forma segura i amb integració contínua sense problemes.",
  "ABOUT_ME_HOBBIES": "Pel que fa a les meues aficions m'agraden els esports (sobretot el bàsquet), els videojocs, els jocs de taula i els animals; sempre que puc intente anar a la naturalesa i poder relaxar-me.",
  "SUCCESS_SEND_MAIL": "S'ha enviat correctament",
  "ERROR_SEND_MAIL": "No s'ha pogut enviar",
  "PRIVACY_POLICY_TITLE": "Política de privacitat",
  "PRIVACY_AND_COOKIE_POLICY": "Política de privacitat y cookies"
}