{
  "HOME": "INICIO",
  "EDUCATION": "FORMACIÓN",
  "WORK EXPERIENCE": "EXPERIENCIA LABORAL",
  "PROJECTS": "PROYECTOS",
  "ABOUT ME": "SOBRE MÍ",
  "CONTACT": "CONTACTO",
  "Software Developer": "Desarrollador de software",
  "see more": "ver más",
  "language": "idioma",
  "ACADEMIC TRAINING": "FORMACIÓN ACADÉMICA",
  "COURSES": "CURSOS",
  "BACHELOR OF SCIENCES": "BACHILLERATO DE CIENCIAS",
  "BACHELOR": "BACHILLERATO",
  "SCIENCES": "CIENTÍFICO",
  "ASSOCIATE DEGREE IN NETWORK SYSTEM ADMINISTRATION": "CICLO FORMATIVO DE GRADO SUPERIOR EN ADMINISTRACIÓN DE SISTEMAS INFORMATICOS EN RED",
  "ASSOCIATE DEGREE": "CICLO FORMATIVO DE GRADO SUPERIOR",
  "NETWORK SYSTEM ADMINISTRATION": "ADMINISTRACIÓN DE SISTEMAS INFORMÁTICOS EN RED",
  "NSA": "CFGS ASIR",
  "ASSOCIATE DEGREE IN WEB DEVELOPMENT": "CICLO FORMATIVO DE GRADO SUPERIOR EN DESARROLLO DE APLICACIONES WEB",
  "WEB DEVELOPMENT": "DESARROLLO DE APLICACIONES WEB",
  "WD": "CFGS DAW",
  "Torrent (Valencia, Spain)": "Torrent (Valencia, España)",
  "Valencia (Spain)": "Valencia (España)",
  "Good practices on Angular": "Buenas prácticas en Angular",
  "Clean Code": "Clean Code",
  "Refactoring and Clean Code techniques": "Técnicas de Refactoring y Clean Code",
  "Node.js and Express": "Node.js y Express",
  "Kubernetes by a DevOps Guru": "Kubernetes por un Gurú de DevOps",
  "Project management Software with Git and GitHub": "Gestión de proyectos Software con Git y GitHub",
  "Download the certificate": "Descargar el certificado",
  "August 2017": "Agosto 2017",
  "January 2019": "Enero 2019",
  "January 2020": "Enero 2020",
  "Task performed": "Tareas realizadas",
  "Systems Administrator": "Administrador de sistemas",
  "ODEC_SOFTARE_DEVELOP_DESCRIPTION": "Empezé en el desarrollo de software en un proyecto de movilidad, donde se creaba una aplicación Android, usando Android Studio, y utilizamos JAVA como lenguaje de la aplicación. Después entré en otro proyecto que consistía en un desarrollo web desde 0. En este proyecto utilizamos AngularJS (1.6) para front-end y JAVA para back-end, en el cual usamos varios patrones, entre ellos inyección de dependencias y programación por capas. Además incorporaba Spring e Hibernate para persistencia de datos y como ORM. En cuanto a la base de datos se usaba MYSQL, y estuve haciendo tareas de full-stack y DevOps, creando las nuevas funcionalidades, mantenimientos y despliegues. Después entré en otros proyectos de menor duración donde usé SQL, JSF, JSP...",
  "Administration of physical servers in a private CPD": "Administración de servidores físicos en un CPD privado",
  "Administration of development teams": "Administración de los equipos de desarrollo",
  "Data and network control": "Control de datos y redes",
  "Virtualization of physical machines": "Virtualización de máquinas físicas",
  "Internal Software Audits": "Auditorías internas de software",
  "Security controls and alerts": "Controles y alertas de seguridad",
  "Purchases of hardware and complementary material": "Gestiones de compra de hardware y material complementario",
  "Management and creation of company accounts": "Gestión y creación de cuentas de empresa",
  "Preparation of environments for development teams": "Preparación de entornos para equipos de desarrollo",
  "Welcome to my website!": "¡Bienvenido/a a mi página web!",
  "I'm Iván Córdoba Donet": "Soy Iván Córdoba Donet",
  "and I work as a software developer": "y trabajo como desarrollador de software",
  "GUD_SOFTARE_DEVELOP_DESCRIPTION": "Durante mi trabajo en Green Urban Data aprendí muchas cosas como por ejemplo arquitectura hexagonal (DDD), testing unitario y e2e con metodologías como TDD, buenas prácticas y clean code, entre otras muchas cosas. Me centraba en tareas completas para el desarrollo de nuevas funcionalidades (tanto front, back, servidores o base de datos). Las principales tecnologías usadas eran docker y docker-compose donde conteníamos la web, Angular en el front con Cypress para el test e2e, Laravel en el back y PostgreSQL para la base de datos. Para todo esto utilizamos los servidores de AWS. Otra cosa a destacar era la implementación de CI/CD con el uso de CircleCI, que junto a git nos permitía esa puesta de valor continua y segura.",
  "Contact me!": "¡Contáctame!",
  "Do you have a project in mind?": "¿Tienes un proyecto en mente?",
  "Do you want a collaboration?": "¿Quieres una colaboración?",
  "Do you need some help?": "¿Necesitas ayuda?",
  "You can send me an email to": "Puedes enviarme un correo electrónico a",
  "or fill out the form": "o completar el formulario",
  "I need to know your name": "Necesito  saber tu nombre",
  "Please enter a valid email address": "Por favor, introduce una dirección de correo electrónico válida",
  "Maybe you want me to contact you": "Quizás quieras que te contacte",
  "The sum is not correct, maybe you are a robot!": "La suma no es correcta, ¡tal vez eres un robot!",
  "It is required to avoid robots": "Se requiere para evitar robots",
  "What do you want to tell me?": "¿Qué quieres decirme?",
  "Send me your message": "Envíame tu mensaje",
  "Name": "Nombre",
  "E-mail": "Email",
  "Leave a message": "Deja un mensaje",
  "ABOUT_ME_DESCRIPTION": "Me considero una persona trabajadora y eficaz. Estudié administración de sistemas y desarrollo web, por lo que puedo hacer cualquier tipo de tareas, me encanta la programación y me gusta aprender siempre las últimas tecnologías. Creo que un buen trabajo no es solo que funcione, sino que desde dentro esté bien estructurado, sea eficiente y por supuesto escalable y sin fallos. Los lenguajes que más uso son JavaScript con Angular, PHP con Laravel y JAVA junto a Spring e Hibernate, y en cuanto a las base de datos he utilizado MySql, PostgreSQL y SQLite, y tengo experiencia en AWS. Todo esto junto a buenas prácticas de desarrollo, conocimientos de arquitectura hexagonal y testing hace que se pueda desarrollar de forma segura y con integración continua sin problemas.",
  "ABOUT_ME_HOBBIES": "En cuanto a mis hobbies me gustan los deportes (sobre todo el baloncesto), los videojuegos, los juegos de mesa y los animales; siempre que puedo intento ir a la naturaleza y poder relajarme.",
  "SUCCESS_SEND_MAIL": "Se ha enviado correctamente",
  "ERROR_SEND_MAIL": "No se ha podido enviar"
}